Repository: ramiroencinas/perl6doc-es
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: es_es

source: A thread can be thought of as a piece of code that may eventually be run on a processor, the arrangement for which is made almost entirely by the virtual machine and/or operating system.
es_es: Un hilo es un trozo de código que se ejecuta en un procesador en un momento dado y su gestión depende casi en su totalidad de la máquina virtual y/o del sistema operativo.

source: A C<Buf> is a mutable sequence of (usually unsigned) integers.
es_es: Un C<Buf> es una secuencia mutable de enteros (normalmente sin signo).

source: A C<Cursor> object is used internally by the regex engine in regex matches to keep track of the current position, backtracking waypoints and information about capturing groups.
es_es: Un objeto C<Cursor> se utiliza internamente por el motor regex en coincidencias regex para llevar el seguimiento de la posición actual, puntos de retroceso e información sobre los grupos de captura.

source: A C<live> L<Supply> is created by the L<Supplier> factory, each emitted value is passed to all the active tappers as they are added:
es_es: La creación de un L<Suministro> a C<tiempo real> se realiza mediante un L<Proveedor> (Supplier) y cada valor emitido se pasa a todos los "taps" o suscriptores activos según se van agregando:

source: A Codepoint string in the "C" L<Unicode Normalization Form|http://www.unicode.org/reports/tr15/>
es_es: Una cadena Codepoint en forma "C" L<Formato de Normalización Unicode|http://www.unicode.org/reports/tr15/>

source: A Codepoint string in the "D" L<Unicode Normalization Form|http://www.unicode.org/reports/tr15/>
es_es: Una cadena Codepoint en forma "D" L<Formato de Normalización Unicode|http://www.unicode.org/reports/tr15/>

source: A Codepoint string in the "KC" L<Unicode Normalization Form|http://www.unicode.org/reports/tr15/>
es_es: Una cadena Codepoint en forma "KC" L<Formato de Normalización Unicode|http://www.unicode.org/reports/tr15/>

source: A Codepoint string in the "KD" L<Unicode Normalization Form|http://www.unicode.org/reports/tr15/>
es_es: Una cadena Codepoint en forma "KD" L<Formato de Normalización Unicode|http://www.unicode.org/reports/tr15/>

source: A L<Channel> is a thread-safe queue that can have multiple readers and writers that could be considered to be similar in operation to a "fifo" or named pipe except it does not enable inter-process communication.
es_es: Un L<Canal> es una cola con seguridad multihilo que permite operaciones simultáneas de lectura y escritura como lo haría un sistema "fifo" o una tubería con nombre excepto que no permite una comunicación entre procesos.

source: A L<Promise> can also be scheduled to be automatically kept at a future time:
es_es: Una L<Promesa> también puede programarse para que se inicie en un futuro:

source: A L<Promise|/type/Promise> (also called I<future> in other programming environments) encapsulates the result of a computation that may not have completed or even started at the time the promise is obtained.
es_es: Una L<Promesa|/type/Promise> (en otros entornos de programación también se denomina I< valor futuro>) es la encapsulación del resultado de una computación que puede no estar disponible todavía.

source: A L<Supply> is an asynchronous data streaming mechanism that can be consumed by one or more consumers simultaneously in a manner similar to "events" in other programming languages and can be seen as enabling "Event Driven" or reactive designs.
es_es: Un L<Suministro> es un mecanismo de transmisión de datos asíncrono que puede ser consumido de forma simúltanea por uno o más consumidores de forma similar a los "eventos" en otros lenguajes de programación. Un L<Suministro> puede considerarse como "Orientado a Eventos" o de diseño reactivo.

source: A common exception type for all errors related to C<DateTime> or C<Date>.
es_es: Un tipo de excepción común para todos los errores relacionados con C<DateTime> o C<Date>.

source: A common role for types that support name-based lookup through C<< postcircumfix:<{ }> >>, for example L<Hash> and L<Map>.
es_es: Un rol común para tipos que soporta localizaciones basadas en nombres a partir de C<< postcircumfix:<{ }> >>, por ejemplo L<Hash> y L<Map>.

source: A library may wish to provide an alternative scheduler implementation if it has special requirements, for instance a UI library may want all code to be run within a single UI thread, or some custom priority mechanism may be required, however the implementations provided as standard and described below should suffice for most user code.
es_es: Es posible que una librería pueda desear proporcionar una implementación alternativa del programador en caso de requerimientos especiales, como por ejemplo una librería de interface gráfica que quiera ejecutar todo su código en un solo hilo, o si se requiere algún mecanismo de priorización personalizada. En cualquier caso las implementaciones proporcionadas como estándar que hemos visto antes deberían ser suficientes para la mayor parte de los casos.

source: A macro is a Routine whose invocation typically happens during parsing.
es_es: Una macro es una Routine cuya invocación, típicamente, sucede durante la interpretación.

source: A second argument can be supplied to C<interval> which specifies a delay in seconds before the first event is fired.
es_es: Se puede proporcionar un segundo argumento a C<interval> para indicar el retraso en segundos después del inicio del primer evento.

source: A simple class is provided with a default constructor, that allows the setting of the attributes of the created object:
es_es: Una clase simple proporciona un constructor por defecto que permite la asignación de atributos en el objeto creado:

source: A thread can either be created and then actually run later:
es_es: Puede crearse un hilo y ejecutarlo después en un momento dado:

source: A typical error message is
es_es: Un mensaje de error típico es

source: A user-space program usually doesn't need to deal with C<Cursor> objects, just with their relatives, L<Match> objects.
es_es: Un programa en el espacio de usuario no necesita, normalmente, tratar con objetos C<Cursor>, solo con sus objetos parientes L<Match>.

source: A very frequent use of promises is to run a piece of code, and keep the promise once it returns successfully, or break it when the code dies.
es_es: Las promesas se utilizan muy a menudo para ejecutar un trozo de código y obtener el resultado correcto o una excepción.

source: Additionally, certain Perl features may implicitly operate in an asynchronous fashion, so in order to ensure predictable interoperation with these features, user code should, where possible, avoid the lower level concurrency APIs (i.e. L<Thread> and L<Scheduler> ) and use the higher-level interfaces.
es_es: Además, algunas funcionalidades de Perl 6 pueden tener aspectos asíncronos, y para garantizar una armonía adecuada entre estos aspectos, es necesario evitar en la medida de lo posible el uso de las APIs de concurrencia de bajo nivel (por ej. L<Hilos|https://doc.perl6.org/type/Thread> y L<Programadores|https://doc.perl6.org/type/Scheduler>) y utilizar en su lugar las interfaces de alto nivel.

source: All exceptions thrown by L<Proc::Async> do this common role.
es_es: Todas las excepciones que se lanzan por parte de L<Proc::Async> tienen en común este rol.

source: An C<on-demand> L<Supply> can also be created from a list of values that will be emitted in turn, thus the first C<on-demand> example could be written as:
es_es: Un L<Suministro> C<a-demanda> también puede crearse desde una lista de valores que se vayan emitiendo uno detrás de otro. De esta forma, el primer ejemplo que hemos visto C<a-demanda> también puede escribirse de esta forma:

source: An existing supply object can be filtered or transformed, using the methods C<grep> and C<map> respectively, to create a new supply in a manner like the similarly named list methods: C<grep> returns a supply such that only those events emitted on the source stream for which the C<grep> condition is true is emitted on the second supply:
es_es: Un objeto suministro puede filtrarse o transformarse mediante los métodos C<grep> y C<map> respectivamente para crear un nuevo suministro de forma parecida a los métodos de lista con nombre similares: C<grep> devuelve un suministro con los eventos que cumplen la condición indicada:

source: An explicit format parameter index, such as C<2$>.
es_es: Un explícito índice de parámetros de formato, tales como C<2$>.

source: An item is queued onto the L<Channel> with the L<method send|/type/Channel#method_send>, and the L<method receive|/type/Channel#method_receive> removes an item from the queue and returns it, blocking until a new item is sent if the queue is empty:
es_es: Mediante el L<método send|/type/Channel#method_send> se encola un elemento en la L<Cola>, mientras que el L<método receive|/type/Channel#method_receive> elimina un elemento de la cola y lo devuelve. La L<Cola> se bloquea si está vacía hasta que se encola en ella un nuevo elemento:

source: And C<anyof> returns a new promise that will be kept when any of the original promises is kept or broken:
es_es: Y C<anyof> devuelve una promesa cuyo resultado está disponible cuando cualquiera de las promesas originales finaliza o da una excepción:

source: Arguments are usually formatted to be only as wide as required to display the given value.
es_es: Los argumentos son por lo general formateados para ser sólo tan amplios como para mostrar el valor dado.

source: Associative does not provide any methods.
es_es: Associative no proporciona ningún método.

source: Assuming that the C<$*SCHEDULER> hasn't been changed from the default, will print the numbers 0 to 10 approximately (i.e with operating system scheduling tolerances) every two seconds.
es_es: Asumiendo que C<$*SCHEDULER> esté por defecto, visualizará los números del 1 al 10 de forma aproximada (dependiendo de la tolerancia que tenga el sistema operativo respecto al programador) con un intervalo de 2 segundos.

source: At its simplest, a L<Supply> is a message stream that can have multiple subscribers created with the method C<tap> on to which data items can be placed with C<emit>.
es_es: Básicamente, un L<Suministro> es una transmisión en forma de mensaje que puede tener varios suscriptores creados con el método C<tap> donde los elementos pueden colocarse con C<emit>.

source: Because C<protect> will block any threads that are waiting to execute the critical section the code should be as quick as possible.
es_es: Como C<protect> bloquea cualquier hilo a la espera de ejecutar la sección crítica, conviene que el código sea lo más rápido posible.

source: Because the higher level classes (L<Promise>, L<Supply> and L<Channel>,) use a L<Lock> where required it is unlikely that user code will need to use a L<Lock> directly.
es_es: Como las clases de alto nivel (L<Promise>, L<Supply> y L<Channel>,) utilizan L<Lock> cuando lo requieren, no es necesario utilizar L<Lock> directamente.

source: Between the C<%> and the format letter, you may specify several additional attributes controlling the interpretation of the format.
es_es: Entre el C<%> y la letra de formato, puede especificar varios atributos adicionales controlando la interpretación del formato.

source: Beyond that there are no further facilities for synchronization or resource sharing which is largely why it should be emphasised that threads are unlikely to be useful directly in user code.
es_es: Más allá de esto no existen funcionalidades relacionadas con la sincronización o el uso compartido de recursos, y por este motivo fundamentalmente el uso directo de hilos no es muy útil.

source: By returning an L<AST>, a macro can inject code into the calling location.
es_es: Una macro puede inyectar código en la posición de la llamada, devolviendo un L<AST>.

source: C Other
es_es: C Other (otro)

source: C<Channel> will return a different L<Channel> fed with the same data each time it is called.
es_es: El método C<Channel> devolverá una vía distinta cada vez que sea llamado, pero con los mismos datos.

source: C<CurrentThreadScheduler> executes tasks on the current threads.
es_es: C<CurrentThreadScheduler> executa tareas en los hilos actuales.

source: C<await> is almost equivalent to calling C<result> on the promise object returned by C<start> but it will also take a list of promises and return the result of each:
es_es: C<await> es casi lo mismo que llamar a C<result> en el objeto promesa devuelto por C<start> y también podrá tomar una lista de promesas y devolver el resultado de cada una:

source: C<keep> changes the status of the promise to C<Kept> setting the result to the positional argument.
es_es: C<keep> establece el resultado en la primera promesa mediante su argumento posicional cambiando su estado a guardado.

source: C<map> returns a new supply such that for each item emitted to the original supply a new item which is the result of the expression passed to the C<map> is emitted:
es_es: C<map> devuelve un nuevo suministro de forma que por cada elemento emitido al suministro original se emite un nuevo elemento como resultado de la expresión que se pasa a C<map>: :

source: C<protect> returns whatever the code block returns.
es_es: C<protect> devuelve lo que devuelve el bloque de código.

source: C<result> blocks the current thread of execution until the promise is kept or broken, if it was kept then it will return the result (that is the value passed to C<keep>, ) otherwise it will throw an exception based on the value passed to C<break>.
es_es: C<result> bloquea el actual hilo de ejecución hasta que la promesa finalice. Si obtiene un resultado, lo devolverá (el valor pasado a C<keep>), y en caso contrario lanzará una excepción basada en el valor pasado al método C<break>.

source: Calling C<done> on the supply object calls the C<done> callback that may be specified for any taps, but does not prevent any further events being emitted to the stream, or taps receiving them.
es_es: Si dentro de un tap llamas a C<done> saldrás del tap en cuestión y no afectará a cualquier otro tap o a la emisión de ningún evento que pudiera producirse.

source: Cf Format
es_es: Cf Format (formato)

source: Channels can be used in place of the L<Supply> in the C<whenever> of a C<react> block described earlier:
es_es: Los canales pueden escribirse como un L<Suministro> en el bloque C<whenever> de un bloque C<react> como vimos antes:

source: Class for a Pod paragraph.
es_es: Clase para un párrafo Pod.

source: Class for items in Pod enumeration lists.
es_es: Clase para los ítemes en las listas enumeradas Pod.

source: Cn Unassigned
es_es: Cn Unassigned (sin asignar)

source: Co Private_Use
es_es: Co Private_Use (uso privado)

source: Common role for IO related errors.
es_es: Rol común para los errores relacionados con E/S.

source: Common role for Pod related errors.
es_es: Rol común para los errores relacionados con Pod.

source: Common role for string types (such as Str) and types that can act as strings (such as Cat).
es_es: Rol común para tipos de cadena (como Str) y tipos que pueden actuar como cadenas (tales como Cat).

source: Common role for string types (such as Str).
es_es: Rol común para tipos de cadenas (tales como Str).

source: Common role for syntax errors thrown by the compiler.
es_es: Rol común debido a errores de sintaxis lanzados por el compilador.

source: Cs Surrogate
es_es: Cs Surrogate (sustituto)

source: Declaring a class creates a I<type object> which, by default, is installed into the current package (just like a variable declared with C<our> scope).
es_es: La declaración de una clase crea un I<tipo objeto> que, por defecto, se instala en el paquete actual (como una variable declarada con C<our>).

source: Despite the apparent advantage the L<Scheduler> interface provides over that of L<Thread> all of functionality is available through higher level interfaces and it shouldn't be necessary to use a scheduler directly, except perhaps in the cases mentioned above where a scheduler can be supplied explicitly to certain methods.
es_es: Aunque exista una ventaja aparente de L<Scheduler> sobre L<Thread> toda la funcionalidad se encuentra disponible mediante interfaces de alto nivel y no debería ser necesario utilizar directamente un programador, excepto quizá, en los casos antes mencionados donde un programador puede proporcionarse de forma explícita a ciertos métodos.

source: Each tap of a supply created by C<interval> has its own sequence starting from 0, as illustrated by the following:
es_es: Cada tap de un suministro creado por C<interval> tiene su propia secuencia comenzando desde 0, como puedes ver a continuación:

source: Error class for failed C<chmod> calls.
es_es: Clase de error para las llamadas fallidas a C<chmod>.

source: Error class for failed L</routine/rmdir> operations.
es_es: Clase de error para las fallidas operaciones L</routine/rmdir>.

source: Error class for failed L</routine/unlink> operation.
es_es: Clase de error para las fallidas operaciones L</routine/unlink>.

source: Error class that is thrown when a L</routine/dir> call fails.
es_es: Clase de error que se lanza cuando falla una llamada a L</routine/dir>.

source: Error class when a L<chdir> call failed.
es_es: Clase de error cuando falla una llamada a L<chdir>.

source: Error class when the runtime fails to determine the current directory.
es_es: Clase de error para cuando la ejecución falla al determinar el directorio actual.

source: Example:
es_es: Ejemplo:

source: Examples:
es_es: Ejemplos:

source: Exception type thrown when the C<...> sequence operator is being called without an explicit closure, and the sequence cannot be deduced.
es_es: Tipo de excepción que se levanta cuando se llama al operador de secuencia C<...> cuando se le llama sin una clausura explícita, y la secuencia no se puede deducir.

source: For example, in this code:
es_es: Por ejemplo, en este código:

source: For example:
es_es: Por ejemplo:

source: For "g" and "G", this specifies the maximum number of digits to show, including those prior to the decimal point and those after it; for example:
es_es: Para "g" y "G", especifica el número máximo de dígitos a mostrar, incluyendo los anteriores al punto decimal y los posteriores a él; por ejemplo:

source: For a good general write-up on this subject see this L<blog post|https://6guts.wordpress.com/2014/04/17/racing-to-writeness-to-wrongness-leads/>.
es_es: En L<este post|https://6guts.wordpress.com/2014/04/17/racing-to-writeness-to-wrongness-leads/> tienes un buen informe sobre este asunto.

source: For example
es_es: Por ejemplo

source: For example,
es_es: Por ejemplo,

source: For example, types such as C<Int> and C<Str> refer to the type object of one of the Perl 6 built-in classes.
es_es: Por ejemplo, tipos como C<Int> y C<Str> se refieren a tipos de objetos de una de las clases incorporadas en Perl 6.

source: For instance
es_es: Por ejemplo

source: For instance,
es_es: Por ejemplo,

source: For instance:
es_es: Por ejemplo:

source: For numeric conversions, you can specify the size to interpret the number as using C<l>, C<h>, C<V>, C<q>, C<L>, or C<ll>.
es_es: Para conversiones numéricas, se puede especificar el tamaño del número a interpretar usando C<l>, C<h>, C<V>, C<q>, C<L>, o C<ll>.

source: For this purpose there is the L<method vow|/type/Promise#method_vow>, which returns a L<Vow> object which becomes the only mechanism by which the promise can be kept or broken.
es_es: Para este propósito existe el L<método vow|/type/Promise#method_vow>, que devuelve un objeto L<Vow> como único mecanismo por el cual se puede producir a demanda la consecución o la excepción de una promesa.

source: Good luck!
es_es: ¡Buena suerte!

source: Here are some more examples; be aware that when using an explicit index, the C<$> may need escaping:
es_es: Éstos son algunos ejemplos más; sea consciente de que cuando se utiliza un índice explícito, el C<$> puede ser necesario escaparlo:

source: Here be dragons.
es_es: A partir de aquí, dragones.

source: Here the C<break> will cause the code block of the C<then> to throw an exception when it calls the C<result> method on the original promise that was passed as an argument, which will subsequently cause the second promise to be broken, raising an exception in turn when its result is taken.
es_es: C<break> produce una excepción en el bloque de código de C<then> al llamar al método C<result> de la promesa original que fue pasada como argumento, que a su vez produce una excepción en la segunda promesa.

source: Here the C<result> of the promise returned is the value returned from the code.
es_es: El valor C<result> que devuelve la promesa es el valor devuelto por el código.

source: Here the C<whenever> keyword creates a tap on the L<Supply> from the provided block.
es_es: La palabra clave C<whenever> crea un tap en el L<Suministro> desde el bloque proporcionado.

source: Here the L<then|/type/Promise#method_then> method schedules code to be executed when the first L<Promise> is kept or broken, itself returning a new L<Promise> which will be kept with the result of the code when it is executed (or broken if the code fails.)
es_es: En este ejemplo el método L<then|/type/Promise#method_then> hace que se ejecute el código de su argumento cuando la primera promesa finalice porque obtenga un resultado o se rompa mediante una excepción, devolviendo a su vez una L<Promesa> nueva que de igual modo finalizará con un resultado o con una excepción.

source: Here the X<C<whenever>> keyword creates a tap on the L<Supply> from the provided block.
es_es: En este caso, la palabra clave X<C<whenever>> crea un tap en el L<Suministro> desde el bloque proporcionado.

source: Here's an example:
es_es: Aquí hay un ejemplo:

source: If a field width obtained through C<*> is negative, it has the same effect as the C<-> flag: left-justification.
es_es: Si un ancho de campo obtenido a través de C<*> es negativo, tiene el mismo efecto que el indicador C<->: alineación a la izquierda.

source: If an attempt to keep or break the Promise is made directly then the exception L<X::Promise::Vowed> will be thrown, as long as the vow object is kept private, the status of the promise is safe:
es_es: Cualquier intento para producir la consecución o la excepción de la Promesa de forma directa no se llevará a cabo y lanzará la excepción L<X::Promise::Vowed>:

source: If the channel has been closed with the L<method close|/type/Channel#method_close> then any C<send> will cause the exception L<X::Channel::SendOnClosed> to be thrown, and a C<receive> will throw a L<X::Channel::ReceiveOnClose> if there are no more items on the queue.
es_es: El L<método close|/type/Channel#method_close> cierra el canal. Cuando el canal está cerrado, el uso del método C<send>, lanzará una excepción L<X::Channel::SendOnClosed>, mientras que el método C<receive> lanzará la excepción L<X::Channel::ReceiveOnClose>.

source: If the exception is marked as seen by a C<when> or C<default> block, the exception is caught and handled.
es_es: Si como vemos, se indica en un bloque C<when> o C<default> la excepción, ésta será controlada y gestionada.

source: If the maximum is exceeded then C<cue> may queue the code until such time as a thread becomes available.
es_es: Si se sobrepasa el máximo, C<cue> puede encolar el código hasta que algún hilo quede disponible.

source: If the promise had not been broken C<cause> would raise a L<X::Promise::CauseOnlyValidOnBroken> exception.
es_es: Si la promesa no genera una excepción, C<cause> tendrá una excepción de tipo L<X::Promise::CauseOnlyValidOnBroken>.
